Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.LineColor
The color of the line.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes.SymbolColor
The color of the mark symbols.